Revit 2027 API
AnalysisDisplayStyle.GetLegendSettings Method
 Get legend settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayLegendSettings GetLegendSettings()
Public Function GetLegendSettings As AnalysisDisplayLegendSettings
public:
AnalysisDisplayLegendSettings^ GetLegendSettings()
member GetLegendSettings : unit -> AnalysisDisplayLegendSettings
Return Value
AnalysisDisplayLegendSettings
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace